laRhea BL
                          laRhea BL
Speed Mix                 laRhea V+
                          Posizionare
la tazza                In Accensione...
Attendere Prego    -  ZUCCHERO  +
                     Posizionare
la tazza                Bevanda pronta
Preleva la tazza     In preparazione
Bevanda n.§1        §1
in preparazione                  Inserire
l'importo esatto           Verifica gruppo
Caffè               Programmazione
OK                   Errore fase di
programmazione       1= KEY ---> VMC
2= VMC ---> KEY     Programmazione
Dati EPROM           Programmazione
RHEA FLASH           prodotti riserva
§1                 FILTRO ACQUA
Lavaggio 10=Iniz       Macchina
Pronta                     SERVICE
CARD                        Non disponibile
                    Reset fondi del
caffè = RESET       Reset fondi del
caffè = P1           
                                  Credito:
§1                         fuori servizio
Filtro Acqua         fuori servizio
pulire Gruppo        Prezzo:    §1
                      fuori servizio
fondi Caffè          Prodotto
Terminato                  ricarica acqua
attendere            attendere
                          attendere
temperatura               Fuori servizio
OFF  §1 §2           Distribut. off
alle:      §1:§2     Accensione Dist.
alle:      §1:§2   TEST VEND
                          Scegli la tua
bevanda favorita      Un ottimo caffè
in pochi secondi    messaggio 3
programmabile           Benvenuto
                          Un ottimo caffè
senza attesa        Inserisci monete
                   temp. Solub. §1
----------------    t.h §1  t.s §2
t.c §3               lettore di carte
non collegato      DATA AUDIT
                         C A R A F F A
                      rheavendors
                        Posizionare
la tazza                no selez. latte
fresco   OFF §1     HAPPY
HOUR                          Bevande gratuite
§1                 No selez. Caffè
in grani OFF §1     Non Usato
                          fuori servizio
mancanza acqua       Caricare l'Acqua
e premere tasto1   Svuotamento
Hydrodinamico           risciacquo
automatico               fuori servizio
                     Errore su Chiave
Codice  §1         1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=Risciacquo
7=Gr 8=BC 9=Desc     1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Risciacquo
8=BC                 1-4=Risciacquo
                     Risciacquo   §1
§2                  Lettore Carte
RFID collegato        Salve      §1
§2-§3-§4 §5 §6:§7     inserire importo
esatto             cambiare
filtro acqua               effettuare il
lavaggio gruppo       Rimuovere
fondi caffè               Set dei Prodotti
---- OK ----       Installazione
                      Fine
Installazione                  Credito = 0
                        avvicinare
la carta                 Carta selezioni
                    Prodotti riserva
CARICARE CAFFÈ     non disponibile
§1                  -  ZUCCHERO  +
                     Effettuare
la Selezione             Modulo Porta
versione §1            Modulo Espresso
versione §1         Modulo Latte
versione §1            Periodic rinse
in §1 seconds         
OFF §1  §2                        Rimuovere
la  tazza                 Attendere carica
boiler vapore      cod. carta cli.
non valida          cod.carta macch.
non valida         selezione
gratis                    GETTONE
                            Prego  Attendere
temperat. Vapore   Prezzo:    §1
Credito §2            First coffee
in progress            svuotare
fondi caffè                Rimuovere
vaschetta                 Inserire
vaschetta                  Lavaggio Vapore
deterg. 10=Iniz.    Inserire deterg.
10=Iniz.           ricarica acqua..
conduc.=§1 uS      Caricare Acqua
10=Iniz.             Lavaggio acqua
calda   10=Iniz.     Cappuccino-R
in accensione...       Tanica del latte
vuota?             S T O P
                            Carta RFID
bloccata                 Cappu-Indux
fare lavaggio           Lavaggio con
deterg. 10=Iniz.       Cyclic Test
round #§1               Cyclic Test
Stopped!!!              Risciacquo acqua
fredda  10=Iniz.   Fine Lavaggio
con detergente        Fine Lavaggio
Vapore deterg.        Attendi lavaggio
Cappuccino-R       Mettere
tazza                       regolazione
macina Attendere        §1
HOT WATER                        Attenzione! sel.
in esaurimento      
                                  Porre Bilancia
Tar.Caffè  PROG       
Reset Automatico                  FINE
DISINSTALLAZIONE               Risu. finale:§1
Premere  <PROG>     Impostaz. timer
lavaggio cappuc.    TEST IN CORSO
Prego  Attendere      conferma reset
dati parzial.P10     Starting Test
4=start PROG=end      TEST MOTOR - §1
sx §2  dx §3        TEST - §1  Tp: §2
up §3  dn §4      Final Result
TEST - §1              System halted
Please restart!       Empty the waste
liquid tank         Inserire tanica
residui latte       Risciacq. §1-§2
........uS=§3       Eseguito check?
Inizio>START/B10    tipo detergente
10=past.12=liqu.    test presenza
latte                 Verif.Detergente
diluito in acqua   Cap.Fare lavag.:
verif.deter. §1    lavaggio  §1-§2
........uS=§3       Dissolvimento
Deterg.   §1 §2       Insert the milk
tube.10:now 9:no    Ins. Tube/refill
Milk 10:now 9:no   Verifica la
presenza latte          Verifica la
qualità latte           Verif. il latte
e fare lavaggio     Gest-  rhMM1.v+?
B1=Abilita B2=no   Lavag. rhMM1.v+
Ora: §1:§2 Ok=P1    Cap.Fare lavag.:
poco deterg. §1    check tank cold
milk temperature    disponibile
                        Chiudere i grani
e premere <PROG>   Aprire  i  grani
e premere <PROG>   1/13 Puliz. Mac.
1=mac1;  2=Mac2    2/13 M§1 Chiusura
campana. 10=ok    3/13 Rim. gruppo
e campana  10=ok   4/13 Inserire
deterg.    10=ok      5/13 Pulizia
macina  10=start       Ciclo §1 of §2
                     6/13 Rip. Puliz.
10=SI;  altro=NO   7/13 Riempimento
campana   10=ok    8/13 Ins.Campana
caffe     10=ok    9/13 Apertura
camp.caffe 10=ok      10/13 Macinatura
caffe. 10=Start    Ciclo §1 of §2
timeout §3 sec       11/13 Rip. Proc.
10=SI;  Altri=NO   12/13 Reinserire
Gruppo.   10=ok    13/13 Caffe?
10=SI;  Altri=NO       erogazione caffe
                   Forthcoming
sched maintenan.        Maintenance must
be performed       Enter Weight
1 = Save  §1           Bevanda pronta
Preleva la tazza     fuori servizio
mancanza acqua       Place your cup
and close flap       Rimuovere
vaschetta                 Inserire
vaschetta                  Please close the
flap               Cappuccino-R
fare lavaggio          Posizionare
la tazza                Inserire
l'importo esatto           Verifica gruppo
Caffè               fuori servizio
pulire Gruppo        Accensione Dist.
alle:      §1:§2   TEST VEND
                          Scegli la tua
bevanda favorita      Un ottimo caffè
in pochi secondi    messaggio 3
programmabile           Benvenuto
                          Un ottimo caffè
senza attesa        Inserisci monete
                   effettuare il
lavaggio gruppo       Rimuovere
fondi caffè               PROGRAMMAZIONE
FINE. Attendere      Codice d'accesso
Disabilitato       Disinstallazione
in corso......      
                                  Calibrazione
non possibile          Togliere Gruppo
e premere PROG      Inserire gruppo
e premere PROG      Aprire rubinetto
boiler 10=inizio   premere tasto
>PROG<                fine disinstall
chiud.rub.Boiler    Acqua aperta ?
10=Inizio            Vaschetta
Inserita? 10=OK           Vaschetta
Inserita? 10=OK           Togliere fondi
Caffè  10=Inizio     Vaschetta vuota?
10=Inizio          Registrazione
Fuori servizio        Registrazione
Fuori servizio        Programmazione
----------------     Preselezione
Non usata              Prodotto §1
0=Disab. §2.§3          Tempo macina §1
§2.§3               Tempo macina
§1.§2                  Inserire grammi
1=Salva  §1         Ent. ML of water
1=Save 2=rep §1    Empties test jug
Test:  1=ok 2=no   Fill H2O FM tank
t.tube 1=ok 2=no   Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=Rinse
8=BC 9=Desc               1-4=Rinse 5=Milk
8=BC               1-4=Rinse
7=grinder 8=BC            1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Mix 5=MilkMd
6=D.M 7=Gr. 8=BC   1-4=Mix 5=MilkMd
6=Desc.Milk 8=BC   RISPARMIO ENERG.
                   Credito:
Carta                      Presentare
una carta                ESEGUIRE CALIB.
MACINA              Ricarica
 bicchieri                 Usa la tua tazza
                   